Tutorial 6 - Water Injection into a Gas Reservoir in OpenFOAM - PitzDaily Case/Case/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoPhysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solutionSpecies
{
   Species 
	{
		D1 D1 [ 0 2 -1 0 0 0 0 ] 2e-7;
		D2 D2 [ 0 2 -1 0 0 0 0 ] 2e-7;
		H H [ 1 -1 -2 0 0 0 0 ] 3.85e8; //2.9e8; 
		Psat Psat [1 -1 -2 0 0 0 0] 20e3;
                Mw Mw [1 0 0 0 -1 0 0] 18; 
                Mg Mg [1 0 0 0 -1 0 0] 44; 
	}
};

// ************************************************************************* //
